nxp-mcuxpresso/mcux-soc-svd/MCXN556T/MCXN556T_cm33_core1.xml
        <register>
          <name>PDC2</name>
          <description>Pin DMA/Trigger Configuration 2</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUPDC16</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC17</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC18</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC19</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC20</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC21</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC22</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC23</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC24</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC25</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC26</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC27</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC28</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC29</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC30</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC31</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDC</name>
          <description>Pin Filter DMA/Trigger Configuration</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILTC1</name>
              <description>Filter Configuration for FILTn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTC2</name>
              <description>Filter Configuration for FILTn</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
