nxp-mcuxpresso/mcux-soc-svd/MCXN556T/MCXN556T_cm33_core1.xml
        <register>
          <name>SINC</name>
          <description>TSI SINC Filter</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x70001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSC_CONTROL_OUT</name>
              <description>SSC Output Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINC_VALID</name>
              <description>SINC Valid</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINC_OVERFLOW_FLAG</name>
              <description>SINC Overflow Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWITCH_ENABLE</name>
              <description>Switch Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECIMATION</name>
              <description>Decimation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dec_1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_2</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_3</name>
                  <description>3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_4</name>
                  <description>4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_5</name>
                  <description>5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_6</name>
                  <description>6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_7</name>
                  <description>7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_8</name>
                  <description>8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_9</name>
                  <description>9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_10</name>
                  <description>10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_11</name>
                  <description>11</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_12</name>
                  <description>12</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_13</name>
                  <description>13</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_14</name>
                  <description>14</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_15</name>
                  <description>15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_16</name>
                  <description>16</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_17</name>
                  <description>17</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_18</name>
                  <description>18</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_19</name>
                  <description>19</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_20</name>
                  <description>20</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_21</name>
                  <description>21</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_22</name>
                  <description>22</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_23</name>
                  <description>23</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_24</name>
                  <description>24</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_25</name>
                  <description>25</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_26</name>
                  <description>26</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_27</name>
                  <description>27</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_28</name>
                  <description>28</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_29</name>
                  <description>29</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_30</name>
                  <description>30</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_31</name>
                  <description>31</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec_32</name>
                  <description>32</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ORDER</name>
              <description>Order</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ord_1</name>
                  <description>Order 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ord_2</name>
                  <description>Order 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUTOFF</name>
              <description>Cutoff</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div_1</name>
                  <description>div = 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_2</name>
                  <description>div = 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_4</name>
                  <description>div = 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_8</name>
                  <description>div = 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_16</name>
                  <description>div = 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_32</name>
                  <description>div = 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_64</name>
                  <description>div = 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_128</name>
                  <description>div = 128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_nc1</name>
                  <description>Do not use</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_nc2</name>
                  <description>Do not use</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_nc3</name>
                  <description>Do not use</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_nc4</name>
                  <description>Do not use</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_nc5</name>
                  <description>Do not use</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_nc6</name>
                  <description>Do not use</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_nc7</name>
                  <description>Do not use</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_nc8</name>
                  <description>Do not use</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
